/* 附魔 */
var enchant = [{
    NAME: '時鐘',
    DISC: '使用技能造成傷害時，30%機率使技能冷卻時間-5。'
},{
    NAME: '怒濤',
    DISC: '主動攻擊時，增加10%攻擊，遭受傷害降低15%。'
},{
    NAME: '魔術',
    DISC: '技能傷害提升10%，範圍技能再提升5%。'
},{
    NAME: '輕風',
    DISC: '造成傷害增加10%，行動結束時，30%的機率移動力+2，持續1回合。'
},{
    NAME: '滿月',
    DISC: '生命80%以上，所有攻防屬性提升10%。'
},{
    NAME: '烈日',
    DISC: '暴擊率增加7%，暴擊傷害增加25%。'
},{
    NAME: '流星',
    DISC: '暴擊率增加7%，攻擊生命值高於60%的部隊時，進入戰鬥後所有傷害+20%。'
},{
    NAME: '鋼鐵',
    DISC: '遭受傷害降低10%。'
},{
    NAME: '荊棘',
    DISC: '被攻擊時有30%反彈本次遭受傷害的50%。'
},{
    NAME: '大樹',
    DISC: '周圍2格所有英雄防禦、魔防增加5%。'
},{
    NAME: '頑石',
    DISC: '生命<50%時，戰鬥後50%機率回覆15%生命。'
},{
    NAME: '寒冰',
    DISC: '被攻擊進入戰鬥時，戰後有20%機率使對方1回合無法行動。'
},{
    NAME: '水晶',
    DISC: '造成治療效果提升20%。'
}];

